# Задача 1: Сложение чисел
#Задание: Написать программу, которая складывает два числа 5 и 3, и выводит результат.
print ('5 + 3 =',5+3)

# Задача 2: Деление с остатком
# Задание: Написать программу, которая делит 8 на 3 и выводит целую часть и остаток от деления.
print ('целочисленное деление 8/3 = ',8//3)
print ("Остаток от деления 8 на 3 = ",8%3)

#Задача 3: Работа со строками
#Задание: Создать две строки: "Python" и "Programming", соединить их с пробелом между ними и вывести результат.
p = "Python"
r = "Programming"
print(p,' ',r )
print (p+' '+r)
h = p+' '+r
print (h)

#Задача 4: Возведение в степень
#Задание: Написать программу, которая возводит число 7 в 3-ю степень.
print(7**3)

#Задача 5: Использование функции len()
#Задание: Написать программу, которая выводит количество символов в строке "Hello, World!".
h = "Hello, World!"
print (len(h))
print (len("Hello, World!"))

#Задача 6: Модуль числа
#Задание: Написать программу, которая находит модуль числа -4.
print ('модуль числа -4  = ',abs(-4))

#Задача 7: Конкатенация строк
#Задание: Соединить строки "Data" и "Science" без пробелов и вывести результат.
print("Data"+"Science")
a = "Data"
b = "Science"
print (a+b)

#Задача 8: Деление нацело
#Задание: Написать программу, которая делит нацело 15 на 2 и выводит результат.
print(15//2)

#Задача 9: Переворот строки
#Задание: Написать программу, которая переворачивает строку "Python" и выводит результат.
d = "Python"
e = d[::-1]
print(e)
print(d[::-1])

#Задача 10: Сложение строк и чисел
#Задание: Написать программу, которая добавляет число 2023 к строке "Year: " и выводит результат.
print("Year" + '2023')
f = 'Year'
g = int(2023)
print (f+str(g))